YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P5</name>
      <description>P5</description>
      <baseAddress>64</baseAddress>
      <registers>
        <register>
          <name>P5IN</name>
          <description>Port 5 Input</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5OUT</name>
          <description>Port 5 Output</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5DIR</name>
          <description>Port 5 Direction</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5REN</name>
          <description>Port 5 Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5SEL0</name>
          <description>Port 5 Select 0</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5SEL1</name>
          <description>Port 5 Select 1</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5SELC</name>
          <description>Port 5 Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5IES</name>
          <description>Port 5 Interrupt Edge Select</description>
          <addressOffset>24</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5IE</name>
          <description>Port 5 Interrupt Enable</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5IFG</name>
          <description>Port 5 Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P5IV</name>
          <description>Port 5 Interrupt Vector Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P5IV</name>
              <description>Port 5 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG0</name>
                  <description>Interrupt Source: Port 5.0 interrupt; Interrupt Flag: P5IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG1</name>
                  <description>Interrupt Source: Port 5.1 interrupt; Interrupt Flag: P5IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG2</name>
                  <description>Interrupt Source: Port 5.2 interrupt; Interrupt Flag: P5IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG3</name>
                  <description>Interrupt Source: Port 5.3 interrupt; Interrupt Flag: P5IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG4</name>
                  <description>Interrupt Source: Port 5.4 interrupt; Interrupt Flag: P5IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG5</name>
                  <description>Interrupt Source: Port 5.5 interrupt; Interrupt Flag: P5IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG6</name>
                  <description>Interrupt Source: Port 5.6 interrupt; Interrupt Flag: P5IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG7</name>
                  <description>Interrupt Source: Port 5.7 interrupt; Interrupt Flag: P5IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P6</name>
      <description>P6</description>
      <baseAddress>64</baseAddress>
      <registers>
        <register>
          <name>P6IN</name>
          <description>Port 6 Input</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6OUT</name>
          <description>Port 6 Output</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6DIR</name>
          <description>Port 6 Direction</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6REN</name>
          <description>Port 6 Resistor Enable</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6SEL0</name>
          <description>Port 6 Select 0</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6SEL1</name>
          <description>Port 6 Select 1</description>
          <addressOffset>13</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6SELC</name>
          <description>Port 6 Complement Select</description>
          <addressOffset>23</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6IES</name>
          <description>Port 6 Interrupt Edge Select</description>
          <addressOffset>25</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6IE</name>
          <description>Port 6 Interrupt Enable</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6IFG</name>
          <description>Port 6 Interrupt Flag</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P6IV</name>
          <description>Port 6 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P6IV</name>
              <description>Port 6 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG0</name>
                  <description>Interrupt Source: Port 6.0 interrupt; Interrupt Flag: P6IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG1</name>
                  <description>Interrupt Source: Port 6.1 interrupt; Interrupt Flag: P6IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG2</name>
                  <description>Interrupt Source: Port 6.2 interrupt; Interrupt Flag: P6IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG3</name>
                  <description>Interrupt Source: Port 6.3 interrupt; Interrupt Flag: P6IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG4</name>
                  <description>Interrupt Source: Port 6.4 interrupt; Interrupt Flag: P6IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG5</name>
                  <description>Interrupt Source: Port 6.5 interrupt; Interrupt Flag: P6IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG6</name>
                  <description>Interrupt Source: Port 6.6 interrupt; Interrupt Flag: P6IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG7</name>
                  <description>Interrupt Source: Port 6.7 interrupt; Interrupt Flag: P6IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
