YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P7</name>
      <description>P7</description>
      <baseAddress>96</baseAddress>
      <registers>
        <register>
          <name>P7IN</name>
          <description>Port 7 Input</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7OUT</name>
          <description>Port 7 Output</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7DIR</name>
          <description>Port 7 Direction</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7REN</name>
          <description>Port 7 Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7SEL0</name>
          <description>Port 7 Select 0</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7SEL1</name>
          <description>Port 7 Select 1</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7SELC</name>
          <description>Port 7 Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7IES</name>
          <description>Port 7 Interrupt Edge Select</description>
          <addressOffset>24</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7IE</name>
          <description>Port 7 Interrupt Enable</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7IFG</name>
          <description>Port 7 Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P7IV</name>
          <description>Port 7 Interrupt Vector Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P7IV</name>
              <description>Port 7 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG0</name>
                  <description>Interrupt Source: Port 7.0 interrupt; Interrupt Flag: P7IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG1</name>
                  <description>Interrupt Source: Port 7.1 interrupt; Interrupt Flag: P7IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG2</name>
                  <description>Interrupt Source: Port 7.2 interrupt; Interrupt Flag: P7IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG3</name>
                  <description>Interrupt Source: Port 7.3 interrupt; Interrupt Flag: P7IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG4</name>
                  <description>Interrupt Source: Port 7.4 interrupt; Interrupt Flag: P7IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG5</name>
                  <description>Interrupt Source: Port 7.5 interrupt; Interrupt Flag: P7IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG6</name>
                  <description>Interrupt Source: Port 7.6 interrupt; Interrupt Flag: P7IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG7</name>
                  <description>Interrupt Source: Port 7.7 interrupt; Interrupt Flag: P7IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P8</name>
      <description>P8</description>
      <baseAddress>96</baseAddress>
      <registers>
        <register>
          <name>P8IN</name>
          <description>Port 8 Input</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8OUT</name>
          <description>Port 8 Output</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8DIR</name>
          <description>Port 8 Direction</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8REN</name>
          <description>Port 8 Resistor Enable</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8SEL0</name>
          <description>Port 8 Select 0</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8SEL1</name>
          <description>Port 8 Select 1</description>
          <addressOffset>13</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8SELC</name>
          <description>Port 8 Complement Select</description>
          <addressOffset>23</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8IES</name>
          <description>Port 8 Interrupt Edge Select</description>
          <addressOffset>25</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8IE</name>
          <description>Port 8 Interrupt Enable</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8IFG</name>
          <description>Port 8 Interrupt Flag</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P8IV</name>
          <description>Port 8 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P8IV</name>
              <description>Port 8 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG0</name>
                  <description>Interrupt Source: Port 8.0 interrupt; Interrupt Flag: P8IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG1</name>
                  <description>Interrupt Source: Port 8.1 interrupt; Interrupt Flag: P8IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG2</name>
                  <description>Interrupt Source: Port 8.2 interrupt; Interrupt Flag: P8IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG3</name>
                  <description>Interrupt Source: Port 8.3 interrupt; Interrupt Flag: P8IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG4</name>
                  <description>Interrupt Source: Port 8.4 interrupt; Interrupt Flag: P8IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG5</name>
                  <description>Interrupt Source: Port 8.5 interrupt; Interrupt Flag: P8IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG6</name>
                  <description>Interrupt Source: Port 8.6 interrupt; Interrupt Flag: P8IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG7</name>
                  <description>Interrupt Source: Port 8.7 interrupt; Interrupt Flag: P8IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
