YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P9</name>
      <description>P9</description>
      <baseAddress>128</baseAddress>
      <registers>
        <register>
          <name>P9IN</name>
          <description>Port 9 Input</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9OUT</name>
          <description>Port 9 Output</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9DIR</name>
          <description>Port 9 Direction</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9REN</name>
          <description>Port 9 Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9SEL0</name>
          <description>Port 9 Select 0</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9SEL1</name>
          <description>Port 9 Select 1</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9SELC</name>
          <description>Port 9 Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9IES</name>
          <description>Port 9 Interrupt Edge Select</description>
          <addressOffset>24</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9IE</name>
          <description>Port 9 Interrupt Enable</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9IFG</name>
          <description>Port 9 Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P9IV</name>
          <description>Port 9 Interrupt Vector Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P9IV</name>
              <description>Port 9 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG0</name>
                  <description>Interrupt Source: Port 9.0 interrupt; Interrupt Flag: P9IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG1</name>
                  <description>Interrupt Source: Port 9.1 interrupt; Interrupt Flag: P9IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG2</name>
                  <description>Interrupt Source: Port 9.2 interrupt; Interrupt Flag: P9IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG3</name>
                  <description>Interrupt Source: Port 9.3 interrupt; Interrupt Flag: P9IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG4</name>
                  <description>Interrupt Source: Port 9.4 interrupt; Interrupt Flag: P9IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG5</name>
                  <description>Interrupt Source: Port 9.5 interrupt; Interrupt Flag: P9IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG6</name>
                  <description>Interrupt Source: Port 9.6 interrupt; Interrupt Flag: P9IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9IFG7</name>
                  <description>Interrupt Source: Port 9.7 interrupt; Interrupt Flag: P9IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P10</name>
      <description>P10</description>
      <baseAddress>128</baseAddress>
      <registers>
        <register>
          <name>P10IN</name>
          <description>Port 10 Input</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10OUT</name>
          <description>Port 10 Output</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10DIR</name>
          <description>Port 10 Direction</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10REN</name>
          <description>Port 10 Resistor Enable</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10SEL0</name>
          <description>Port 10 Select 0</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10SEL1</name>
          <description>Port 10 Select 1</description>
          <addressOffset>13</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10SELC</name>
          <description>Port 10 Complement Select</description>
          <addressOffset>23</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10IES</name>
          <description>Port 10 Interrupt Edge Select</description>
          <addressOffset>25</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10IE</name>
          <description>Port 10 Interrupt Enable</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P10IFG</name>
          <description>Port 10 Interrupt Flag</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
