YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>ADC</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>ADCHI</name>
          <description>ADC Window Comparator High Threshold Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADCMEM0</name>
          <description>ADC Conversion Memory Register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADCIV</name>
          <description>ADC Interrupt Vector</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCIV</name>
              <description>interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCOVIFG</name>
                  <description>Interrupt Source: ADCMEM0 overflow; Interrupt Flag: ADCOVIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCTOVIFG</name>
                  <description>Interrupt Source: Conversion time overflow; Interrupt Flag: ADCTOVIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCHIIFG</name>
                  <description>Interrupt Source: ADCHI Interrupt flag; Interrupt Flag: ADCHIIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCLOIFG</name>
                  <description>Interrupt Source: ADCLO Interrupt flag; Interrupt Flag: ADCLOIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINIFG</name>
                  <description>nterrupt Source: ADCIN Interrupt flag; Interrupt Flag: ADCINIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIFG0</name>
                  <description>Interrupt Source: ADC memory Interrupt flag; Interrupt Flag: ADCIFG0; Interrupt Priority: Lowest</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BKMEM</name>
      <description>BKMEM</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>BAKMEM4</name>
          <description>Backup Memory 4.</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM7</name>
          <description>Backup Memory 7.</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM8</name>
          <description>Backup Memory 8.</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM9</name>
          <description>Backup Memory 9.</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM10</name>
          <description>Backup Memory registers. Backup Memory 10.</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM15</name>
          <description>Backup Memory 15.</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>E_COMP1</name>
      <description>eCOMP1</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>CP1IV</name>
          <description>Comparator Interrupt Vector Word Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPIV</name>
              <description>Comparator interrupt vector word register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIFG</name>
                  <description>CPIFG</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIIFG</name>
                  <description>CPIIFG</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CP1DACCTL</name>
          <description>6-bit Comparator built-in DAC Control Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPDACSW</name>
              <description>This bit is only valid when CPDACBUFS is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACSW_0</name>
                  <description>CPDACBUF1 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACSW_1</name>
                  <description>CPDACBUF2 selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACBUFS</name>
              <description>Comparator built-in DAC buffer controlled source selection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACBUFS_0</name>
                  <description>Comparator output is selected as the buffer control source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUFS_1</name>
                  <description>CPDACSW bit is selected as the buffer control source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACREFS</name>
              <description>Comparator built-in DAC reference voltage selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACREFS_0</name>
                  <description>VDD selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACREFS_1</name>
                  <description>on-chip VREF selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACEN</name>
              <description>Comparator built-in DAC output control bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACEN_0</name>
                  <description>DAC output is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACEN_1</name>
                  <description>DAC output is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
