YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CS</name>
      <description>CS</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>CSCTL4</name>
          <description>Clock System Control 4</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SELMS</name>
              <description>Selects the MCLK and SMCLK source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOCLKDIV</name>
                  <description>DCOCLKDIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOCLK</name>
                  <description>REFOCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1CLK</name>
                  <description>XT1CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <description>VLOCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_4</name>
                  <description>Reserved for future use</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_5</name>
                  <description>Reserved for future use</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_6</name>
                  <description>Reserved for future use</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_7</name>
                  <description>Reserved for future use</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>Selects the ACLK source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1CLK</name>
                  <description>XT1CLK with divider (must be no more than 40 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOCLK</name>
                  <description>REFO (internal 32-kHz clock source)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <description>VLO (internal 10-kHz clock source)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL7</name>
          <description>Clock System Control Register 7</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>REFOREADY</name>
              <description>REFO ready flag. This bit reflects the REFO readiness whent REFO is good for operation (such as FLL reference)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFOREADY_0</name>
                  <description>REFO unstable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOREADY_1</name>
                  <description>REFO ready to go</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOFFG</name>
              <description>DCO fault flag. If this bit is set, the OFIFG flag is also set. The DCOFFG bit is set if DCO = {0} or DCO = {511}. DCOFFG can be cleared by software. If the DCO fault condition still remains, DCOFFG is set. As long as DCOFFG is set, FLLUNLOCK shows the DCOERROR condition.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFFG_0</name>
                  <description>No fault condition occurred after the last reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFFG_1</name>
                  <description>DCO fault. A DCO fault occurred after the last reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1OFFG</name>
              <description>T1 oscillator fault flag. If this bit is set, the OFIFG flag is also set. XT1OFFG is set if a XT1 fault condition exists. XT1OFFG can be cleared by software. If the XT1 fault condition still remains, XT1OFFG is set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1OFFG_0</name>
                  <description>No fault condition occurred after the last reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1OFFG_1</name>
                  <description>XT1 fault. An XT1 fault occurred after the last reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLULIFG</name>
              <description>FLL unlock interrupt flag. This flag is set when FLLUNLOCK bits equal 10b (DCO too fast). If FLLULPUC is also set, a PUC is triggered when FLLUIFG is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLULIFG_0</name>
                  <description>FLLUNLOCK bits not equal to 10b</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLULIFG_1</name>
                  <description>FLLUNLOCK bits equal to 10b</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENSTFCNT1</name>
              <description>Enable start counter for XT1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENSTFCNT1_0</name>
                  <description>Startup fault counter disabled. Counter is cleared..</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENSTFCNT1_1</name>
                  <description>Startup fault counter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLUNLOCK</name>
              <description>Unlock. These bits indicate the current FLL unlock condition. These bits are both set as long as the DCOFFG flag is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLUNLOCK_0</name>
                  <description>FLL is locked. No unlock condition currently active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_1</name>
                  <description>DCOCLK is currently too slow.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_2</name>
                  <description>DCOCLK is currently too fast.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_3</name>
                  <description>DCOERROR. DCO out of range.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLUNLOCKHIS</name>
              <description>Unlock history bits. These bits indicate the FLL unlock condition history. As soon as any unlock condition happens, the respective bits are set and remain set until cleared by software by writing 0 to it or by a POR.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_0</name>
                  <description>FLL is locked. No unlock situation has been detected since the last reset of these bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_1</name>
                  <description>DCOCLK has been too slow since the bits were cleared.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_2</name>
                  <description>DCOCLK has been too fast since the bits were cleared.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_3</name>
                  <description>DCOCLK has been both too fast and too slow since the bits were cleared.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLULPUC</name>
              <description>FLL unlock PUC enable. If the FLLULPUC bit is set, a reset (PUC) is triggered if FLLULIFG is set. FLLULIFG indicates when FLLUNLOCK bits equal 10 (too fast). FLLULPUC is automatically cleared upon servicing the event. If FLLULPUC is cleared (0), no PUC can be triggered by FLLULIFG.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
            <field>
              <name>FLLWARNEN</name>
              <description>Warning enable. If this bit is set, an interrupt is generated based on the FLLUNLOCKHIS bits. If FLLUNLOCKHIS is not equal to 00, an OFIFG is generated.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLWARNEN_0</name>
                  <description>FLLUNLOCKHIS status cannot set OFIFG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLWARNEN_1</name>
                  <description>FLLUNLOCKHIS status can set OFIFG.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL8</name>
          <description>Clock System Control Register 8</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>ACLK clock request enable. Setting this enables conditional module requests for ACLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACLKREQEN_0</name>
                  <description>ACLK conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLKREQEN_1</name>
                  <description>ACLK conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>MCLK clock request enable. Setting this enables conditional module requests for MCLK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCLKREQEN_0</name>
                  <description>MCLK conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLKREQEN_1</name>
                  <description>MCLK conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>SMCLK clock request enable. Setting this enables conditional module requests for SMCLK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMCLKREQEN_0</name>
                  <description>SMCLK conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLKREQEN_1</name>
                  <description>SMCLK conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODOSCREQEN</name>
              <description>MODOSC clock request enable. Setting this enables conditional module requests for MODOSC.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODOSCREQEN_0</name>
                  <description>MODOSC conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODOSCREQEN_1</name>
                  <description>MODOSC conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
