YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>RTC</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>RTCMOD</name>
          <description>RTC Counter Modulo Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SAC0</name>
      <description>SAC0</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>SAC0DACSTS</name>
          <description>SAC DAC Status Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DACIFG</name>
              <description>SAC DAC data update flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SAC1</name>
      <description>SAC1</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>SAC1DACSTS</name>
          <description>SAC DAC Status Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DACIFG</name>
              <description>SAC DAC data update flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SAC2</name>
      <description>SAC2</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>SAC2DACSTS</name>
          <description>SAC DAC Status Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DACIFG</name>
              <description>SAC DAC data update flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SAC3</name>
      <description>SAC3</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>SAC3DACSTS</name>
          <description>SAC DAC Status Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DACIFG</name>
              <description>SAC DAC data update flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <description>SYS</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>SYSJMBI0</name>
          <description>JTAG Mailbox Input</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>JTAG mailbox incoming message low byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
            <field>
              <name>MSGHI</name>
              <description>JTAG mailbox incoming message high byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <description>JTAG Mailbox Output 1 Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>JTAG mailbox outgoing message low byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
            <field>
              <name>MSGHI</name>
              <description>JTAG mailbox outgoing message high byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSRSTIV</name>
          <description>Reset Vector Generator</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRSTIV</name>
              <description>Reset interrupt vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOR</name>
                  <description>Brownout</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTNMI</name>
                  <description>RSTIFG RST/NMI</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR</name>
                  <description>PMMSWBOR software BOR</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5WU</name>
                  <description>LPMx.5 wakeup</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECYV</name>
                  <description>Security violation</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_12</name>
                  <description>Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG</name>
                  <description>SVSHIFG SVSH event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_16</name>
                  <description>Reserved</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_18</name>
                  <description>Reserved</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR</name>
                  <description>PMMSWPOR software POR</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIFG</name>
                  <description>WDTIFG watchdog timeout</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTPW</name>
                  <description>WDTPW watchdog password violation</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCTLPW</name>
                  <description>FRCTLPW password violation</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <description>Uncorrectable FRAM bit error detection</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERF</name>
                  <description>Peripheral area fetch</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMPW</name>
                  <description>PMM password violation</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_34</name>
                  <description>Reserved</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUL</name>
                  <description>FLL unlock (PUC)</description>
                  <value>36</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
