YuhanLiin/msp430fr2355/msp430fr2355.svd
        <register>
          <name>TB3IV</name>
          <description>Timer_Bx Interrupt Vector Register</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIV</name>
              <description>Timer_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR1</name>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR2</name>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR3</name>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR4</name>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR5</name>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR6</name>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG</name>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>E_USCI_A0</name>
      <description>eUSCI_A0</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>UCA0MCTLW</name>
          <description>eUSCI_Ax Modulation Control Word Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCOS16</name>
              <description>Oversampling mode enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOS16_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOS16_1</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRF</name>
              <description>First modulation stage select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
            <field>
              <name>UCBRS</name>
              <description>Second modulation stage select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0TXBUF</name>
          <description>eUSCI_Ax Transmit Buffer Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>Transmit data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0TXBUF</name>
          <description>eUSCI_Ax Transmit Buffer Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>Transmit data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0ABCTL</name>
          <description>eUSCI_Ax Auto Baud Rate Control Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCABDEN</name>
              <description>Automatic baud-rate detect enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCABDEN_0</name>
                  <description>Baud-rate detection disabled. Length of break and synch field is not measured.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCABDEN_1</name>
                  <description>Baud-rate detection enabled. Length of break and synch field is measured and baud-rate settings are changed accordingly.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBTOE</name>
              <description>Break time out error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBTOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBTOE_1</name>
                  <description>Length of break field exceeded 22 bit times</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTOE</name>
              <description>Synch field time out error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTOE_1</name>
                  <description>Length of synch field exceeded measurable time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCDELIM</name>
              <description>Break/synch delimiter length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCDELIM_0</name>
                  <description>1 bit time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_1</name>
                  <description>2 bit times</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_2</name>
                  <description>3 bit times</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_3</name>
                  <description>4 bit times</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IRCTL</name>
          <description>eUSCI_Ax IrDA Control Word Register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCIREN</name>
              <description>IrDA encoder/decoder enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIREN_0</name>
                  <description>IrDA encoder/decoder disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIREN_1</name>
                  <description>IrDA encoder/decoder enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRTXCLK</name>
              <description>IrDA transmit pulse clock select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIRTXCLK_0</name>
                  <description>BRCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIRTXCLK_1</name>
                  <description>BITCLK16 when UCOS16 = 1. Otherwise, BRCLK.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRTXPL</name>
              <description>Transmit pulse length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
            <field>
              <name>UCIRRXFE</name>
              <description>IrDA receive filter enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIRRXFE_0</name>
                  <description>Receive filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIRRXFE_1</name>
                  <description>Receive filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRRXPL</name>
              <description>IrDA receive input UCAxRXD polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>IrDA transceiver delivers a high pulse when a light pulse is seen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>IrDA transceiver delivers a low pulse when a light pulse is seen</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRRXFL</name>
              <description>Receive filter length</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IV</name>
          <description>eUSCI_Ax Interrupt Vector Register</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCIV</name>
              <description>eUSCI_A interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <description>Interrupt Source: Receive buffer full; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG</name>
                  <description>Interrupt Source: Start bit received; Interrupt Flag: UCSTTIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXCPTIFG</name>
                  <description>Interrupt Source: Transmit complete; Interrupt Flag: UCTXCPTIFG; Interrupt Priority: Lowest</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IV</name>
          <description>eUSCI_Ax Interrupt Vector Register</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCIV</name>
              <description>eUSCI_A interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
