YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>E_USCI_B0</name>
      <description>eUSCI_B0</description>
      <baseAddress>8</baseAddress>
      <registers>
        <register>
          <name>UCB0STATW</name>
          <description>eUSCI_Bx Status Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCBBUSY</name>
              <description>Bus busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Bus inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Bus busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCGC</name>
              <description>General call address received</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGC_0</name>
                  <description>No general call address received</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGC_1</name>
                  <description>General call address received</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSCLLOW</name>
              <description>SCL low</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSCLLOW_0</name>
                  <description>SCL is not held low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSCLLOW_1</name>
                  <description>SCL is held low</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBCNT</name>
              <description>Hardware byte counter value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0STATW</name>
          <description>UCB0STATW_SPI</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCOE</name>
              <description>Overrun error flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOE_1</name>
                  <description>Overrun error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCFE</name>
              <description>Framing error flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCFE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCFE_1</name>
                  <description>Bus conflict occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>Listen enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLISTEN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLISTEN_1</name>
                  <description>Enabled. UCBxTXD is internally fed back to the receiver</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0TXBUF</name>
          <description>eUSCI_Bx Transmit Buffer Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>Transmit data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0TXBUF</name>
          <description>eUSCI_Bx Transmit Buffer Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>Transmit data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0I2COA0</name>
          <description>eUSCI_Bx I2C Own Address 0 Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>I2COA0</name>
              <description>I2C own address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>Own Address enable register</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The slave address defined in I2COA0 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The slave address defined in I2COA0 is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCGCEN</name>
              <description>General call response enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGCEN_0</name>
                  <description>Do not respond to a general call</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGCEN_1</name>
                  <description>Respond to a general call</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0ADDMASK</name>
          <description>eUSCI_Bx I2C Address Mask Register</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADDMASK</name>
              <description>Address Mask Register. By clearing the corresponding bit of the own address, this bit is a don't care when comparing the address on the bus to the own address. Using this method, it is possible to react on more than one slave address. When all bits of ADDMASKx are set, the address mask feature is deactivated. Modify only when UCSWRST = 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0IV</name>
          <description>eUSCI_Bx Interrupt Vector Register</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCIV</name>
              <description>eUSCI_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCALIFG</name>
                  <description>Interrupt Source: Arbitration lost; Interrupt Flag: UCALIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCNACKIFG</name>
                  <description>Interrupt Source: Not acknowledgment; Interrupt Flag: UCNACKIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG</name>
                  <description>Interrupt Source: Start condition received; Interrupt Flag: UCSTTIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTPIFG</name>
                  <description>Interrupt Source: Stop condition received; Interrupt Flag: UCSTPIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG3</name>
                  <description>Interrupt Source: Slave 3 Data received; Interrupt Flag: UCRXIFG3</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG3</name>
                  <description>Interrupt Source: Slave 3 Transmit buffer empty; Interrupt Flag: UCTXIFG3</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG2</name>
                  <description>Interrupt Source: Slave 2 Data received; Interrupt Flag: UCRXIFG2</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG2</name>
                  <description>Interrupt Source: Slave 2 Transmit buffer empty; Interrupt Flag: UCTXIFG2</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG1</name>
                  <description>Interrupt Source: Slave 1 Data received; Interrupt Flag: UCRXIFG1</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG1</name>
                  <description>Interrupt Source: Slave 1 Transmit buffer empty; Interrupt Flag: UCTXIFG1</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG0</name>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG0</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG0</name>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG0</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBCNTIFG</name>
                  <description>Interrupt Source: Byte counter zero; Interrupt Flag: UCBCNTIFG</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTOIFG</name>
                  <description>Interrupt Source: Clock low timeout; Interrupt Flag: UCCLTOIFG</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBIT9IFG</name>
                  <description>Interrupt Source: Nineth bit position; Interrupt Flag: UCBIT9IFG; Priority: Lowest</description>
                  <value>30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0IV</name>
          <description>eUSCI_Bx Interrupt Vector Register</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCIV</name>
              <description>eUSCI_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
