YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAPTIO</name>
      <description>CAPTIO</description>
      <baseAddress>14</baseAddress>
      <registers>
        <register>
          <name>CAPTIOCTL</name>
          <description>Capacitive Touch IO 0 Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CAPTIOPISEL</name>
              <description>Capacitive Touch IO pin select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPTIOPISEL_0</name>
                  <description>Px.0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_1</name>
                  <description>Px.1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_2</name>
                  <description>Px.2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_3</name>
                  <description>Px.3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_4</name>
                  <description>Px.4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_5</name>
                  <description>Px.5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_6</name>
                  <description>Px.6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_7</name>
                  <description>Px.7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTIOPOSEL</name>
              <description>Capacitive Touch IO port select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PJ</name>
                  <description>Px = PJ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1</name>
                  <description>Px = P1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2</name>
                  <description>Px = P2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3</name>
                  <description>Px = P3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4</name>
                  <description>Px = P4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5</name>
                  <description>Px = P5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6</name>
                  <description>Px = P6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7</name>
                  <description>Px = P7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8</name>
                  <description>Px = P8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9</name>
                  <description>Px = P9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10</name>
                  <description>Px = P10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P11</name>
                  <description>Px = P11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12</name>
                  <description>Px = P12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P13</name>
                  <description>Px = P13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P14</name>
                  <description>Px = P14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15</name>
                  <description>Px = P15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTIOEN</name>
              <description>Capacitive Touch IO enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>All Capacitive Touch IOs are disabled. Signal towards timers is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Selected Capacitive Touch IO is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTIO</name>
              <description>Capacitive Touch IO state</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPTIO_0</name>
                  <description>Curent state 0 or Capacitive Touch IO is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIO_1</name>
                  <description>Current state 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
