YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMM</name>
      <description>PMM</description>
      <baseAddress>16</baseAddress>
      <registers>
        <register>
          <name>PM5CTL0</name>
          <description>Power mode 5 control register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LOCKLPM5</name>
              <description>LPMx.5 Lock Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKLPM5_0</name>
                  <description>LPMx.5 configuration is not locked and defaults to its reset condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKLPM5_1</name>
                  <description>LPMx.5 configuration remains locked. Pin state is held during LPMx.5 entry and exit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM5SW</name>
              <description>Reports or sets the LPM3.5 switch connection upon the switch mode set by LPM5SM. When this bit is set, the VLPM3.5 domain can accept full-speed read and write operation by CPU MCLK. If the switch is disconnected, all peripherals within this domain can only accept the operation no more than 40 kHz. In automatic mode (LPM5SM = 0), this bit represents the switch connection between Vcore and VLPM3.5. Any write to this bit has no effect. In manual mode (LPM5SM = 1), this bit can be fully read and written by software. When this bit is set, the switch connection between Vcore and VLPM3.5 is connected. Otherwise, the switch is disconnected.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM5SW_0</name>
                  <description>LPMx.5 switch disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5SW_1</name>
                  <description>LPMx.5 switch connected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM5SM</name>
              <description>Specifies the operation mode of the LPM3.5 switch.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM5SM_0</name>
                  <description>Automatic mode for LPM3.5 switch that the switch is fully handled by the circuitry during mode switch.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5SM_1</name>
                  <description>Manual mode for LPM3.5 switch that the switch is specified by LPM5SW bit setting in software.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TB0</name>
      <description>TB0</description>
      <baseAddress>16</baseAddress>
      <registers>
        <register>
          <name>TB0R</name>
          <description>Timer_B count register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR0</name>
          <description>Timer_B Capture/Compare  Register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR1</name>
          <description>Timer_B Capture/Compare  Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0IV</name>
          <description>Timer_Bx Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIV</name>
              <description>Timer_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR1</name>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR2</name>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR3</name>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR4</name>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR5</name>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR6</name>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG</name>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
