YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TB1</name>
      <description>TB1</description>
      <baseAddress>16</baseAddress>
      <registers>
        <register>
          <name>TB1R</name>
          <description>Timer_B count register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB1CCR0</name>
          <description>Timer_B Capture/Compare  Register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB1CCR1</name>
          <description>Timer_B Capture/Compare  Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB1IV</name>
          <description>Timer_Bx Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIV</name>
              <description>Timer_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR1</name>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR2</name>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR3</name>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR4</name>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR5</name>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR6</name>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG</name>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TB2</name>
      <description>TB2</description>
      <baseAddress>16</baseAddress>
      <registers>
        <register>
          <name>TB2R</name>
          <description>Timer_B count register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB2CCR0</name>
          <description>Timer_B Capture/Compare  Register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB2CCR1</name>
          <description>Timer_B Capture/Compare  Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB2IV</name>
          <description>Timer_Bx Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIV</name>
              <description>Timer_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR1</name>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR2</name>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR3</name>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR4</name>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR5</name>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR6</name>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG</name>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
