YuhanLiin/msp430fr2355/msp430fr2355.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PJ</name>
      <description>PJ</description>
      <baseAddress>288</baseAddress>
      <registers>
        <register>
          <name>PJIN</name>
          <description>Port J Input</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJOUT</name>
          <description>Port J Output</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJDIR</name>
          <description>Port J Direction</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJREN</name>
          <description>Port J Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJSEL0</name>
          <description>Port J Select 0</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJSEL1</name>
          <description>Port J Select 1</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJSELC</name>
          <description>Port J Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65408</baseAddress>
      <interrupt>
        <name>PORT4</name>
        <description>0xFFCE</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>PORT3</name>
        <description>0xFFD0</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFD2</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFD4</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>SAC1_SAC3</name>
        <description>0xFFD6</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>SAC0_SAC2</name>
        <description>0xFFD8</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>ECOMP0_ECOMP1</name>
        <description>0xFFDA</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>0xFFDC</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B1</name>
        <description>0xFFDE</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B0</name>
        <description>0xFFE0</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A1</name>
        <description>0xFFE2</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A0</name>
        <description>0xFFE4</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFE6</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>0xFFE8</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_B1</name>
        <description>0xFFEA</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_B0</name>
        <description>0xFFEC</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_B1</name>
        <description>0xFFEE</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_B0</name>
        <description>0xFFF0</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_B1</name>
        <description>0xFFF2</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_B0</name>
        <description>0xFFF4</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B1</name>
        <description>0xFFF6</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B0</name>
        <description>0xFFF8</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC</description>
        <value>44</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
